app/views/user_mailer/access_request.html.erb

SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
    <p>
      There is a request to access the application Deployment Directory from <%=User.last.name%>.<br>