app/views/users/_form.html.erb

SELECT "roles".* FROM "roles"
---
    <%= form.label :role_id %>
    <%= form.collection_select :role_id, Role.all , :id, :name,{include_blank: true},{multiple: false,class: 'form-control selectpicker'} %>