app/views/events/_form.html.erb

SELECT "companies".* FROM "companies"
---
    <%= form.label :Company %>
    <%= form.collection_select :company_id, Company.all , :id, :name_with_cluster,{include_blank: true},{multiple: false,class: 'form-control selectpicker'} %>

SELECT "event_types".* FROM "event_types"
---
    <%= form.label :event_type %>
    <%= form.collection_select :event_type_id, EventType.all , :id, :event_type,{include_blank: false},{multiple: false,class: 'form-control selectpicker'} %>