app/views/companies/_form.html.erb

SELECT "deployments".* FROM "deployments"
---
    <%= form.label :deployment %>
    <%= form.collection_select :deployment_id, Deployment.all ,:id,:name,{selected: company_deployments(company)}, {multiple: true, class: 'form-control selectpicker'} %>

SELECT "clusters".* FROM "clusters"
---
    <%= form.label :cluster %>
    <%= form.collection_select(:cluster_id,  Cluster.all , :id, :name,{include_blank: false},{class: 'form-control selectpicker'}, ) %>

SELECT "csm_infos".* FROM "csm_infos"
---
    <%= form.label :csm %>
    <%= form.collection_select(:csm_info_id,  CsmInfo.all , :id, :name,{include_blank: true},{class: 'form-control selectpicker'}, ) %>