app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies" WHERE "companies"."cluster_id" = 1 ORDER BY companies.name ASC
SELECT "deployments".* FROM "deployments" WHERE "deployments"."id" IN (1, 2, 3, 4, 5)
SELECT "clusters".* FROM "clusters" WHERE "clusters"."id" = 1
SELECT "clusters"."id" FROM "clusters" WHERE "clusters"."name" = $1  [["name", "staging"]]
SELECT  "companies".* FROM "companies" ORDER BY companies.name ASC LIMIT $1 OFFSET $2  [["LIMIT", 13], ["OFFSET", 0]]
---
  def index

    company_scope = Company.includes(:deployments,:plugins,:cluster)
    company_scope = company_scope.cluster(params[:cluster_id]) if params[:cluster_id]
    company_scope = company_scope.where(cluster_id: params[:cluster]) if params[:cluster]
    company_scope = company_scope.search(params[:search]) if params[:search]
    company_scope = company_scope.order("companies.name ASC")
    company_scope = company_scope.all.paginate(page: params[:page], per_page: 13) if params[:skip_pagination] != "true"

INSERT INTO "companies" ("name", "system_name", "created_at", "updated_at", "cluster_id", "csm_info_id", "last_updated_by") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "plugins" ("name", "entity_id", "entity_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "adapter_ui"], ["entity_id", 1], ["entity_type", "Company"], ["created_at", "2019-03-28 13:58:28.114445"], ["updated_at", "2019-03-28 13:58:28.114445"]]
SELECT "deployments".* FROM "deployments" WHERE "deployments"."id" IN (NULL, 1, 2, 3, 4, 5)
---
  def create
    @company = Company.new(company_params.except(:deployment_id,:plugin_name))
    @company.deployments << Deployment.where(id: company_params[:deployment_id])

UPDATE "plugins" SET "entity_id" = NULL WHERE "plugins"."entity_id" = $1 AND "plugins"."entity_type" = $2 AND "plugins"."id" = 12  [["entity_id", 2], ["entity_type", "Company"]]
INSERT INTO "plugins" ("name", "entity_id", "entity_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "api_adapter"], ["entity_id", 2], ["entity_type", "Company"], ["created_at", "2019-04-11 09:32:10.179916"], ["updated_at", "2019-04-11 09:32:10.179916"]]
SELECT "deployments".* FROM "deployments" INNER JOIN "companies_deployments" ON "deployments"."id" = "companies_deployments"."deployment_id" WHERE "companies_deployments"."company_id" = $1  [["company_id", 2]]
---
  def update
    respond_to do |format|
      if @company.update(company_params.except(:deployment_id,:plugin_name))
        @company.deployments << Deployment.where(id: company_params[:deployment_id])