app/controllers/events_controller.rb

  def index
    event_scope = Event.all.includes(:plugins,company: :cluster)
    event_scope = event_scope.search(params[:search]) if params[:search]

      if params[:purge_passive]
        event_scope.purge_passive params[:date_search]
        flash[:notice] = "All Passive Events were successfully Purged."
      end
    event_scope = event_scope.passive(params[:date_search]) if params[:date_search].present?
    event_scope = event_scope.cluster_events(params[:cluster_id]) if params[:cluster_id]
    event_scope = event_scope.cluster_events(params[:cluster]) if params[:cluster]
    event_scope = event_scope.order("events.purge_status")
    event_scope = event_scope.order("events.updated_at DESC")
    event_scope = event_scope.all.paginate(page: params[:page], per_page: 30) if params[:skip_pagination] != "true"
---
SELECT "events".* FROM "events" WHERE "events"."company_id" IN (SELECT "companies"."id" FROM "companies" WHERE "companies"."cluster_id" = 1) ORDER BY events.purge_status, events.updated_at DESC
SELECT COUNT(*) FROM "events" WHERE (purge_date < '%2019-04-13%')
UPDATE "events" SET "purge_status" = 't' WHERE (purge_date < '%2019-04-13%')
SELECT  "events".* FROM "events" ORDER BY events.purge_status, events.updated_at DESC LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]

  def create
    @event = Event.new(event_params.except(:plugin_name,:purge_date, :creation_date, :link ,:purge_status))
    plugin_names.each do |name|
      @event.plugins << @event.plugins.where(name: name).first_or_initialize
---
INSERT INTO "events" ("event_name", "event_system_name", "start_date", "end_date", "creation_date", "purge_date", "card_no", "link", "created_at", "updated_at", "company_id", "event_type_id", "purge_status", "last_updated_by") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
INSERT INTO "plugins" ("name", "entity_id", "entity_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "guided_tour"], ["entity_id", 2], ["entity_type", "Event"], ["created_at", "2019-03-28 14:00:33.054499"], ["updated_at", "2019-03-28 14:00:33.054499"]]