app/controllers/users_controller.rb

  def index
    user_scope = User.includes(:role)
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" IN (1, 4)
SELECT "users".* FROM "users"